app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Mansplainers 101"], ["room_number", "25A"], ["created_at", "2021-03-27 18:37:07.326772"], ["updated_at", "2021-03-27 18:37:07.326772"]]
---
    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @school_class.save

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", "25AB"], ["updated_at", "2021-03-27 18:38:17.432174"], ["id", 2]]
---
    def update
        find_class
        @school_class.update(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_class
        @school_class = SchoolClass.find_by(id: params[:id])