app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Gremelda"], ["last_name", "Humperdink"], ["created_at", "2021-03-27 18:27:08.796858"], ["updated_at", "2021-03-27 18:27:08.796858"]]
---
    def create
        @student = Student.new(params.require(:student).permit(:first_name, :last_name))
        @student.save

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordanna"], ["updated_at", "2021-03-27 18:31:34.601352"], ["id", 1]]
---
    def update
        find_student
        @student.update(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_student
        @student = Student.find_by(id: params[:id])